-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 01, 2023 at 04:40 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `project_traveling`
--

DELIMITER $$
--
-- Functions
--
CREATE DEFINER=`root`@`localhost` FUNCTION `haversine` (`lat1` DOUBLE, `lon1` DOUBLE, `lat2` DOUBLE, `lon2` DOUBLE) RETURNS DOUBLE NO SQL
    DETERMINISTIC
    SQL SECURITY INVOKER
    COMMENT 'Haversine Formula to Calculate Approximate distance Between two'
BEGIN
return 6371 * (ACOS(COS(RADIANS(lat1)) * COS(RADIANS(lat2)) *
              COS(RADIANS(lon2) - RADIANS(lon1)) +
              SIN(RADIANS(lat1)) * SIN(RADIANS(lat2))
            ));
END$$

DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `table_event`
--

CREATE TABLE `table_event` (
  `ev_id` int(11) UNSIGNED NOT NULL,
  `ev_name` text NOT NULL,
  `ev_desc` longtext CHARACTER SET utf8 NOT NULL,
  `ev_date_beg` date NOT NULL,
  `ev_date_end` date NOT NULL,
  `ev_day_beg` tinyint(3) UNSIGNED NOT NULL,
  `ev_month_beg` tinyint(3) UNSIGNED NOT NULL,
  `ev_day_end` tinyint(3) UNSIGNED NOT NULL,
  `ev_month_end` tinyint(3) UNSIGNED NOT NULL,
  `ev_day_type` enum('sun','moon') NOT NULL DEFAULT 'sun',
  `ev_img_list` text NOT NULL,
  `ev_ref_place_id` int(11) UNSIGNED NOT NULL,
  `ev_origin` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_event`
--

INSERT INTO `table_event` (`ev_id`, `ev_name`, `ev_desc`, `ev_date_beg`, `ev_date_end`, `ev_day_beg`, `ev_month_beg`, `ev_day_end`, `ev_month_end`, `ev_day_type`, `ev_img_list`, `ev_ref_place_id`, `ev_origin`) VALUES
(24, 'มาฆบูชา ณ วัดพระศรีมหาธาตุ', '<div style=\"content-align:center;\">\r\n<h2>บรรยากาศที่วัดพระศรีมหาธาตุ</h2> \r\n<p>มีประชาชนทยอยเดินทางมาทำบุญ ไหว้พระ เนื่องในวันมาฆบูชา ปี 2565 ซึ่งถือเป็นวันพระใหญ่แรกของปี และเป็นวันสำคัญทางพระพุทธศาสนา กันอย่างคึกคัก ต่างพากันมาเป็นครอบครัว ที่พาผู้สูงอายุ เด็ก มาทำบุญไหว้พระขอพร พร้อมถวายสังฆทาน และเวียนเทียนรอบพระธาตุ ที่เปิดให้ประชาชนมาทำบุญได้ตลอดทั้งวัน โดยตั้งแต่ช่วงเช้าที่ผ่าน มีประชาชนเดินทางมาอย่างไม่ขาดสายจนค่อนข้างที่จะแออัดในช่วงของการรอไหว้พระ และถวายสังฆทาน</p>\r\n\r\n<img src=\"./images/1677146720.jpg\" width=\"320\" height=\"240\">\r\n\r\nสำหรับกิจกรรมในวัดนั้น มีทั้งการถวายสังฆทาน รับศีลรับพรจากพระสงฆ์ ตักบาตรพระประจำวัน เติมน้ำมันตะเกียง สักการะพระเจดีย์ศรีมหาธาตุซึ่งภายในมีเจดีย์องค์เล็กประดิษฐานพระบรมสารีริกธาตุ รวมถึงสักการะพระพุทธรูปศักดิ์สิทธิ์ โดยเฉพาะพระพุทธรูปปางนาคปรก เพื่อความเป็นสิริมงคลชีวิต?ให้มีความเจริญรุ่งเรืองยิ่งขึ้น\r\n\r\n</div>\r\n<a href=\"https://www.innnews.co.th/news/news-general/news_292534/\">ที่มา : https://www.innnews.co.th/news/news-general/news_292534/</a>', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677146722.jpg	', 6, 1),
(26, 'วันวิสาขบูชา ณ วัดสาขลา', '<h3>ความสำคัญในวันวิสาขบูชา</h3>\r\n<p>\r\nวันวิสาขบูชาเป็นวันที่ระลึกถึงวันประสูติ ตรัสรู้ และปรินิพพานของพระพุทธเจ้า ซึ่งตรงกับวันเพ็ญ เดือนวิสาขมาส (เดือน 6) ตรงกันทั้ง 3 คราว คือ\r\n</p>\r\n<p>\r\nเช้าวันศุกร์ ขึ้น 15 ค่ำ เดือน 6 ปีจอ ก่อนพุทธศักราช 80 ปี เจ้าชายสิทธัตถะ ประสูติ ที่พระราชอุทยานลุมพินีวันระหว่างกรุงกบิลพัสดุ์กับเทวทหะ\r\nเช้ามืดวันพุธ ขึ้น 15 ค่ำ เดือน 6 ปีระกา ก่อนพุทธศักราช 45 ปี เจ้าชายสิทธัตถะ ตรัสรู้ เป็นพระสัมมาสัมพุทธเจ้า เมื่อพระชนมายุ 35 พรรษา ณ ใต้ร่มไม้ศรีมหาโพธิ์ ฝั่งแม่น้ำเนรัญชรา ตำบลอุรุเวลาเสนานิคม หลังจากออกผนวชได้ 6 ปี ปัจจุบัน สถานที่แห่งนี้เรียกว่า พุทธคยา เป็นตำบลหนึ่งของเมืองคยา แห่งรัฐพิหาร ประเทศอินเดีย\r\nหลังจากตรัสรู้ ทรงออกประกาศพระธรรมวินัยและโปรดเวไนยสัตว์เป็นเวลา 45 ปี เมื่อพระชนมายุได้ 80 พรรษา ก็ เสด็จดับขันธปรินิพพาน เมื่อวันอังคาร ขึ้น 15 ค่ำ เดือน 6 ปีมะเส็ง ณ สาลวโนทยาน ของมัลลกษัตริย์ เมืองกุสินารา แคว้นมัลละ (ปัจจุบันอยู่ในเมืองกุสีนคระ รัฐอุตตรประเทศ ประเทศอินเดีย)\r\nเนื่องจากเหตุการณ์สำคัญทั้ง 3 เหตุการณ์ดังกล่าวข้างต้น เกิดขึ้นตรงกันในวันเพ็ญ เดือน 6 ชาวพุทธจึงเรียกการบูชาในวันนี้ว่า \"วันวิสาขบูชา\" ซึ่งแปลว่า การบูชาในวันเพ็ญเดือนหก (บางแห่งเรียกว่า วันพระพุทธเจ้า หรือ พุทธชยันตี)\r\n</p>\r\n<p>\r\nวัดสาขลา วัดเก่าแก่ศูนย์รวมจิตใจของชุมชนบ้านสาขลา ตั้งอยู่ในอำเภอพระสมุทรเจดีย์ เป็นสถานที่เที่ยวชม พักผ่อน ได้ความรู้ ชมพระปรางค์เอน กราบสักการะหลวงพ่อโต รับรู้เรื่องราวความเป็นมาของวัดผ่านพิพิธภัณฑ์ ที่เป็นแหล่งรวบรวมความรู้ ชมวัตถุโบราณมากมาย จากนั้นเดินช้อปของฝากจากตลาดชุมชน มีผลิตภัณฑ์ชุมชนต้นตำรับ \"กุ้งเหยียด\" หนึ่งเดียวไม่เหมือนใคร การเดินทางมาวัดไม่ยาก รถยนต์เข้าได้ไม่ลำบาก และมีรถประจำทางเข้าถึง\r\n</p>\r\n<p>\r\nวัดสาขลา ตั้งอยู่บริเวณบ้านสาขลา ตำบลนาเกลือ อำเภอพระสมุทรเจดีย์ เป็นเส้นทางก่อนที่จะถึงป้อมพระจุลจอมเกล้า ให้เลี้ยวเข้าทางไป อบต.แหลมฟ้าผ่า จากนั้นตรงไปจนสุดทางประมาณ 9 กิโลเมตรก็ถึง หากใครไม่มีรถส่วนตัว ก็นั่งรถเมล์มาลงที่พระสมุทรเจดีย์ แล้วต่อรถสองแถวไปถึงวัดสาขลาเลย\r\n</p>\r\n<a href=\"https://www.sanook.com/travel/1432477/\"> อ้างอิง </a>', '2023-06-03', '2023-06-03', 15, 6, 15, 6, 'moon', './images/1677406166.jpg', 8, 1),
(32, 'แฟชันไอแลนต์', 'ศูนย์การค้าที่มีทำเลที่ดีที่สุดในรามอินทรา เป็นศูนย์การค้าชั้นนำ ขนาดใหญ่และทันสมัย ตั้งอยู่บนเนื้อที่ 100 ไร่ มีพื้นที่ใช้สอย 350,000 ตรม. รองรับรถยนต์ได้มากถึง 50,000 คัน/วัน และมีร้านค้าชั้นนำกว่า 600 ร้านค้า มีปริมาณผู้คนเข้าศูนย์การค้ากว่า 120,000 คน/วัน ให้บริการครบวงจร ก่อตั้งขึ้นโดย บริษัท สยาม รีเทล ดีเวลล็อปเม้นท์ จำกัด หนึ่งในบริษัทค้าปลีก ที่เติบโตเร็วที่สุดในประเทศไทย และเป็นผู้พัฒนาศูนย์การค้าเดอะพรอมานาดและเทอร์มินอล21 สาขาโคราช มีเป้าหมายในการพัฒนาที่ดินเพื่อธุรกิจค้าปลีกที่ทันสมัยที่สุด สร้างประสบการณ์ความสุขที่มากกว่าการช้อปปิ้งเพื่อให้สมาชิกในครอบครัวของคุณได้มาใช้เวลา และแบ่งปันความสนุกในพื้นที่ของเรา', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677673592.jpg	', 10, 1),
(33, 'เซ็นทรัลลาดพร้าว', 'เซ็นทรัล ลาดพร้าว[5] (อังกฤษ: Central Ladprao)[6] เป็นศูนย์การค้า สำนักงาน ศูนย์แสดงสินค้า และโรงแรมครบวงจร ซึ่งเป็นธุรกิจพัฒนาอสังหาริมทรัพย์เพื่อการค้าปลีก แห่งแรกของบริษัท เซ็นทรัลพัฒนา จำกัด (มหาชน) ตั้งอยู่ทางทิศเหนือของกรุงเทพมหานคร บริเวณที่ดินสามเหลี่ยมใกล้แยกลาดพร้าว เปิดให้บริการครั้งแรกในเดือนธันวาคม พ.ศ. 2524 และมีพิธีเปิดอย่างเป็นทางการในเดือนเมษายน พ.ศ. 2526', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677674507.jpg', 11, 1),
(34, 'สนามบินดอนเมือง', ' (ชื่อเดิมคือ ท่าอากาศยานกรุงเทพ) หรือ สนามบินดอนเมือง เป็นท่าอากาศยานในประเทศไทย ที่ตั้งอยู่บนถนนวิภาวดีรังสิต แขวงสนามบิน เขตดอนเมือง ช่วงกิโลเมตรที่ 24 ทางตอนเหนือของกรุงเทพมหานคร เป็นจุดศูนย์กลางทางการบินในเอเชียตะวันออกเฉียงใต้ ที่สามารถเชื่อมโยงการคมนาคมทางอากาศไปยังจุดต่าง ๆ ของโลกได้อย่างเหมาะสม ไม่ว่าจะเป็นการบินภายในภูมิภาคเอเชียด้วยกัน หรือระหว่างทวีปยุโรป ทวีปอเมริกา ทวีปออสเตรเลีย ซึ่งสามารถใช้เป็นจุดแวะลงและเชื่อมต่อในการเดินทางของผู้โดยสารตลอดจนพัสดุไปรษณียภัณฑ์ไปยังจุดอื่น ๆ ได้เป็นอย่างดี', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677674918.jpg', 12, 1),
(35, 'ฟิวเจอร์ปาร์ครังสิต', 'เป็นศูนย์การค้าขนาดใหญ่ ตั้งอยู่บริเวณถนนพหลโยธิน และถนนรังสิต-นครนายก ตำบลประชาธิปัตย์ อำเภอธัญบุรี จังหวัดปทุมธานี บริหารโดยบริษัท รังสิตพลาซ่า จำกัด เปิดให้บริการเมื่อวันที่ 17 มีนาคม พ.ศ. 2538 พร้อมกับฟิวเจอร์พาร์ค บางแค', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677675364.jpg', 13, 1),
(36, 'งานมาฆบูชา ณ วัดกลางวรวิหาร', 'วัดกลางวรวิหาร พระอารามหลวงชั้นโท ชนิดวรวิหาร ตั้งอยู่ในตำบลปากน้ำ อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ เป็นวัดสมัยอยุธยา เดิมชื่อ วัดตะโกทอง ในปี พ.ศ. 2459 พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัวได้ยกฐานะเป็นพระอารามหลวงชั้นโท ชนิดวรวิหาร อาณาเขตของวัดมีพื้นที่ 25 ไร่ (ไม่นับรวมที่ธรณีสงฆ์ 49 ไร่)', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677675913.jpg', 14, 1),
(37, 'งานมาฆบูชา ณ วัดโพธิยาราม', '<p>วัดโพธิยาราม เป็นวัดราษฎร์สังกัดคณะสงฆ์ฝ่ายมหานิกาย ตั้งอยู่ในตำบลท้ายบ้าน อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ วัดอยู่ไม่ไกลจากฟาร์มจระเข้และสวนสัตว์สมุทรปราการ ปัจจุบันพระครูโพธิสมุทรคุณ (เด่น) เป็นเจ้าอาวาส[1]</p>\r\n<p>\r\nวัดโพธิยาราม หรือ วัดทองคง ได้รับอนุญาตให้สร้างขึ้นเมื่อวันที่ 22 พฤศจิกายน พ.ศ. 2511[2] โดยมีนายสิน ทองคง เป็นผู้ดำเนินการสร้างและบริจาคที่ดินร่วมกับหลวงสุขเวชวรกิจ (จรูญ ทองคง) นางบำราศโรคาพาฬห์ (ถมยา) กระทรวงศึกษาธิการได้ประกาศตั้งเป็นวัดเมื่อวันที่ 28 มกราคม พ.ศ. 2513 ที่ได้นามอย่างนั้นเพราะวัดตั้งอยู่ใกล้โค้งโพธิ์[3] วัดได้รับพระราชทานวิสุงคามสีมาเมื่อวันที่ 8 พฤศจิกายน พ.ศ. 2514 เขตวิสุงคามสีมากว้าง 40 เมตร ยาว 80 เมตรได้ผูกพัทธสีมาเมื่อเดือนกุมภาพันธ์ พ.ศ. 2518 ด้านการศึกษาทางวัดได้เปิดสอนพระปริยัติธรรมเริ่มมาตั้งแต่ พ.ศ. 2508\r\n</p>', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677676644.png', 15, 1),
(38, 'งานมาฆบูชา ณ วัดอโศการาม', '<b>วัดอโศการาม</b> <p>มีที่ตั้ง ประมาณ 53 ไร่ และเป็นที่ที่เมื่อประมาณปี พ.ศ. 2497 - พ.ศ. 2498 เป็นปีที่พระสุทธิธรรมรังสี (ลี ธมฺมธโร) เริ่มก่อตั้งสำนักสงฆ์ขึ้นมา เพราะฉะนั้นภิกษุส่วนมากที่อยู่ตามป่าจะอยู่ในการดูแลของท่านพ่อลี และยึดแนววัตรปฏิบัติของท่านพ่อลี นาแม่ขาว เป็นชือตำบลเป็นที่ตั้งของวัดอโศการามปัจจุบัน ตามประวัติที่กล่าวไว้ในหนังสือชีวประวัติ พระสุทธิธรรมรังสีคัมภีรเมธาจารย์ (พระอาจารย์ลีธมฺมธโร) ความว่า\" ที่ตั้งวัดอโศการามปัจจุบันนี้ เดิมเรียกว่า \"นาแม่ขาว\" เจ้าของที่ดินคือ นางกิมหงษ์ และนายสุเมธ ไกรกาญจน์ ได้ถวายที่ดินให้สร้างวัดเนื้อที่ประมาณ 53 ไร่ เมื่อ ปี พ.ศ. 2497 จนกระทั่งปี พ.ศ. 2498 จึงได้เริ่มตั้งสำนักขึ้นเป็นครั้งแรก โดยให้พระลูกศิษย์ คือพระครูใบฎีกาทัศน์ มาเฝ้าสำนักแทน พร้อมกับลูกศิษย์อีก 5 รูป รวมมีพระที่สำนักนี้ในครั้งเริ่มตั้ง จำนวน 6 รูป\" เมื่อออกพรรษาและได้จัดงานพระราชทานเพลิงศพสมเด็จฯ เรียบร้อยแล้ว เป็นปี พ.ศ. 2498 ท่านพ่อลี จึงได้ออกไปจำพรรษาที่วัดอโศการาม</p>', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677677024.jpg', 7, 1),
(39, 'งานมาฆบูชา ณ วัดชัยมงคล', 'วัดชัยมงคลสร้างขึ้นเมื่อประมาณ พ.ศ. 1893 สมัยกรุงสุโขทัยตอนปลายต่อกับสมัยกรุงศรีอยุธยาตอนต้น จากหลักฐานที่กรมศิลปากรสำรวจและขึ้นทะเบียนโบราณวัตถุของวัด ได้รับพระราชทานวิสุงคามสีมาถือว่าได้รับพระราชทานมาแต่เดิมประมาณ พ.ศ. 1893[1] จัดเป็นวัดแห่งแรกในชุมชนคลองปากน้ำ เดิมชาวเมืองเรียก วัดมอญ โบสถ์ของวัดไม่ได้หันหน้าไปทางทิศตะวันออกอย่างวัดไทยทั่วไป แต่จะหันโบสถ์ไปทางทิศเหนืออันเป็นที่ตั้งของเมืองหงสาวดี ต่อมาได้กลายเป็นวัดร้างเป็นเวลานานจึงขาดการบันทึกประวัติความเป็นมาที่ต่อเนื่อง', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677677876.jpg	', 16, 1),
(40, 'งานมาฆบูชา ณ วัดศรีจันทประดิษฐ์', '<b>วัดศรีจันทร์ประดิษฐ์</b> <p>เป็นวัดราษฎร์สังกัดคณะสงฆ์ฝ่ายมหานิกาย ตั้งอยู่ในตำบลบางปูใหม่ อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ ที่ดินที่ตั้งวัดมีเนื้อที่ 17 ไร่ 2 งาน 96 ตารางวา มีที่ธรณีสงฆ์ จำนวน 9 แปลง เนื้อที่ 5 ไร่ 1 งาน 73 ตารางวา ลักษณะที่ตั้งวัดเป็นพื้นที่ลาบลุ่ม ทิศตะวันออกจดหมู่บ้านคลองต่อและถนนสุขุมวิท ด้วนทิศตะวันตกและทิศเหนือจดโรงงานอุตสาหกรรมและโรงเรียนมัธยมวัดศรีจันทร์ประดิษฐ์ ด้านทิศใต้จดชายทะเลปากอ่าวไทย ด้านในวัดติดทะเลมีสะพานไม้ทอดยาวออกไปยังศาลากลางทะเล</p>', '2023-03-06', '2023-03-06', 15, 3, 15, 3, 'moon', './images/1677678585.jpg', 17, 1),
(41, 'วันวิสาขบูชา ณ วัดศรีจันทประดิษฐ์', '<b>วัดศรีจันทร์ประดิษฐ์</b> <p>เป็นวัดราษฎร์สังกัดคณะสงฆ์ฝ่ายมหานิกาย ตั้งอยู่ในตำบลบางปูใหม่ อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ ที่ดินที่ตั้งวัดมีเนื้อที่ 17 ไร่ 2 งาน 96 ตารางวา มีที่ธรณีสงฆ์ จำนวน 9 แปลง เนื้อที่ 5 ไร่ 1 งาน 73 ตารางวา ลักษณะที่ตั้งวัดเป็นพื้นที่ลาบลุ่ม ทิศตะวันออกจดหมู่บ้านคลองต่อและถนนสุขุมวิท ด้วนทิศตะวันตกและทิศเหนือจดโรงงานอุตสาหกรรมและโรงเรียนมัธยมวัดศรีจันทร์ประดิษฐ์ ด้านทิศใต้จดชายทะเลปากอ่าวไทย ด้านในวัดติดทะเลมีสะพานไม้ทอดยาวออกไปยังศาลากลางทะเล</p>', '2023-06-03', '2023-06-03', 15, 6, 15, 6, 'moon', './images/1677679084.webp	', 17, 1),
(42, 'วันวิสาขบูชา ณ วัดอโศการาม', '<b>วัดอโศการาม </b><p>มีที่ตั้ง ประมาณ 53 ไร่ และเป็นที่ที่เมื่อประมาณปี พ.ศ. 2497 - พ.ศ. 2498 เป็นปีที่พระสุทธิธรรมรังสี (ลี ธมฺมธโร) เริ่มก่อตั้งสำนักสงฆ์ขึ้นมา เพราะฉะนั้นภิกษุส่วนมากที่อยู่ตามป่าจะอยู่ในการดูแลของท่านพ่อลี และยึดแนววัตรปฏิบัติของท่านพ่อลี นาแม่ขาว เป็นชือตำบลเป็นที่ตั้งของวัดอโศการามปัจจุบัน ตามประวัติที่กล่าวไว้ในหนังสือชีวประวัติ พระสุทธิธรรมรังสีคัมภีรเมธาจารย์ (พระอาจารย์ลีธมฺมธโร) ความว่า\" ที่ตั้งวัดอโศการามปัจจุบันนี้ เดิมเรียกว่า \"นาแม่ขาว\" เจ้าของที่ดินคือ นางกิมหงษ์ และนายสุเมธ ไกรกาญจน์ ได้ถวายที่ดินให้สร้างวัดเนื้อที่ประมาณ 53 ไร่ เมื่อ ปี พ.ศ. 2497 จนกระทั่งปี พ.ศ. 2498 จึงได้เริ่มตั้งสำนักขึ้นเป็นครั้งแรก โดยให้พระลูกศิษย์ คือพระครูใบฎีกาทัศน์ มาเฝ้าสำนักแทน พร้อมกับลูกศิษย์อีก 5 รูป รวมมีพระที่สำนักนี้ในครั้งเริ่มตั้ง จำนวน 6 รูป\" เมื่อออกพรรษาและได้จัดงานพระราชทานเพลิงศพสมเด็จฯ เรียบร้อยแล้ว เป็นปี พ.ศ. 2498 ท่านพ่อลี จึงได้ออกไปจำพรรษาที่วัดอโศการาม</p>', '2023-06-03', '2023-06-03', 15, 6, 15, 6, 'moon', './images/1677677024.jpg	', 7, 1),
(43, 'วันวิสาขบูชา ณ วัดกลางวรวิหาร', 'วัดกลางวรวิหาร พระอารามหลวงชั้นโท ชนิดวรวิหาร ตั้งอยู่ในตำบลปากน้ำ อำเภอเมืองสมุทรปราการ จังหวัดสมุทรปราการ เป็นวัดสมัยอยุธยา เดิมชื่อ วัดตะโกทอง ในปี พ.ศ. 2459 พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัวได้ยกฐานะเป็นพระอารามหลวงชั้นโท ชนิดวรวิหาร อาณาเขตของวัดมีพื้นที่ 25 ไร่ (ไม่นับรวมที่ธรณีสงฆ์ 49 ไร่)', '2023-06-03', '2023-06-03', 15, 6, 15, 6, 'moon', './images/1677675913.jpg', 14, 1),
(44, 'งานวิสาขบูชา ณ วัดชัยมงคล', 'วัดชัยมงคลสร้างขึ้นเมื่อประมาณ พ.ศ. 1893 สมัยกรุงสุโขทัยตอนปลายต่อกับสมัยกรุงศรีอยุธยาตอนต้น จากหลักฐานที่กรมศิลปากรสำรวจและขึ้นทะเบียนโบราณวัตถุของวัด ได้รับพระราชทานวิสุงคามสีมาถือว่าได้รับพระราชทานมาแต่เดิมประมาณ พ.ศ. 1893[1] จัดเป็นวัดแห่งแรกในชุมชนคลองปากน้ำ เดิมชาวเมืองเรียก วัดมอญ โบสถ์ของวัดไม่ได้หันหน้าไปทางทิศตะวันออกอย่างวัดไทยทั่วไป แต่จะหันโบสถ์ไปทางทิศเหนืออันเป็นที่ตั้งของเมืองหงสาวดี ต่อมาได้กลายเป็นวัดร้างเป็นเวลานานจึงขาดการบันทึกประวัติความเป็นมาที่ต่อเนื่อง', '2023-06-03', '2023-06-03', 15, 6, 15, 6, 'moon', './images/1677677876.jpg	', 16, 1),
(45, 'งานอาสาฬหบูชา ณ วัดกลางวรวิหาร', '<b>วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)</b> <p>เป็นวันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย[1] คำว่า อาสาฬหบูชา ย่อมาจาก \"อาสาฬหปูรณมีบูชา\" แปลว่า \"การบูชาในวันเพ็ญเดือนอาสาฬหะ\" อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8 ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน 8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน</p>', '2023-08-01', '2023-08-01', 15, 8, 15, 8, 'moon', './images/1677681776.jpg	', 14, 1),
(46, 'งานอาสาฬหบูชา ณ วัดอโศการาม', '<b>วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)</b> <p>เป็นวันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย[1] คำว่า อาสาฬหบูชา ย่อมาจาก \"อาสาฬหปูรณมีบูชา\" แปลว่า \"การบูชาในวันเพ็ญเดือนอาสาฬหะ\" อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8 ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน 8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน</p>', '2023-08-01', '2023-08-01', 15, 8, 15, 8, 'moon', './images/1677418306.jpg', 7, 1),
(47, 'งานอาสาฬหบูชา ณ วัดชัยมงคล', '<b>วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)</b> <p>เป็นวันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย[1] คำว่า อาสาฬหบูชา ย่อมาจาก \"อาสาฬหปูรณมีบูชา\" แปลว่า \"การบูชาในวันเพ็ญเดือนอาสาฬหะ\" อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8 ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน 8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน</p>', '2023-08-01', '2023-08-01', 15, 8, 15, 8, 'moon', './images/1677677876.jpg', 16, 1),
(48, 'งานอาสาฬหบูชา ณ วัดโพธิยาราม', '<b>วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)</b> <p>วันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย[1] คำว่า อาสาฬหบูชา ย่อมาจาก \"อาสาฬหปูรณมีบูชา\" แปลว่า \"การบูชาในวันเพ็ญเดือนอาสาฬหะ\" อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8 ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน 8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน</p>', '2023-08-01', '2023-08-01', 15, 8, 15, 8, 'moon', './images/1677676644.png	', 15, 1),
(49, 'งานอาสาฬหบูชา ณ วัดศรีจันทประดิษฐ์', '<b>วันอาสาฬหบูชา (บาลี: อาสาฬหปูชา; อักษรโรมัน: Āsāḷha Pūjā)</b> <p>วันสำคัญทางศาสนาพุทธนิกายเถรวาทและวันหยุดราชการในประเทศไทย[1] คำว่า อาสาฬหบูชา ย่อมาจาก \"อาสาฬหปูรณมีบูชา\" แปลว่า \"การบูชาในวันเพ็ญเดือนอาสาฬหะ\" อันเป็นเดือนที่สี่ตามปฏิทินของประเทศอินเดีย ตรงกับวันเพ็ญ เดือน 8 ตามปฏิทินจันทรคติของไทย ซึ่งมักจะตรงกับเดือนกรกฎาคมหรือเดือนสิงหาคม แต่ถ้าในปีใดมีเดือน 8 สองหน ก็ให้เลื่อนไปทำในวันเพ็ญเดือน 8 หลังแทน</p>', '2023-08-01', '2023-08-01', 15, 8, 15, 8, 'moon', './images/1677679084.webp', 15, 1);

-- --------------------------------------------------------

--
-- Table structure for table `table_file`
--

CREATE TABLE `table_file` (
  `file_id` int(10) UNSIGNED NOT NULL,
  `file_name` text NOT NULL,
  `file_path` text NOT NULL,
  `file_uploader` int(11) NOT NULL,
  `file_type` tinytext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_file`
--

INSERT INTO `table_file` (`file_id`, `file_name`, `file_path`, `file_uploader`, `file_type`) VALUES
(7, 'WIN_20210802_18_19_23_Pro.mp4', '1674626997.mp4', 1, 'video'),
(8, 'WIN_20210802_18_32_09_Pro.mp4', '1674626998.mp4', 1, 'video'),
(9, 'Screenshot_20230125-161427_Maps.jpg', '1674638116.jpg', 1, 'image'),
(10, 'received_584189403098407.mp4', '1674701139.mp4', 1, 'video'),
(12, 'ศาลากลางจังหวัด-สป.png', '1674701609.png', 1, 'image'),
(14, 'songkran-3.jpg', '1674715382.jpg', 1, 'image'),
(15, 'efwefw.jpg', '1674715494.jpg', 1, 'image'),
(16, 'ชาวคลองด่านเมืองปากน้ำร่วมประเพณีแห่หลวงปู่ปานทางทะเล.mp4', '1674716382.mp4', 1, 'video'),
(17, '2021-11-19.jpg', '1674717267.jpg', 1, 'image'),
(18, 'ขบวนแห่ประเพณีสงกรานต์พระประแดง ประจำปี2561 ขบวนที่1.mp4', '1674718263.mp4', 1, 'video'),
(19, 'Screenshot (47).png', '1676386715.png', 1, 'image'),
(20, 'Screenshot (48).png', '1676388302.png', 1, 'image'),
(21, 'w644.jpg', '1676711216.jpg', 1, 'image'),
(22, 'otop_img_11638177728.jpg', '1676730870.jpg', 1, 'image'),
(23, '002367.png', '1676798385.png', 1, 'image'),
(24, 'R.jpg', '1676985251.jpg', 1, 'image'),
(26, 'mida-airport-hotel-bangkok.jpg', '1677146591.jpg', 1, 'image'),
(27, '859854-1536x864.jpg', '1677146720.jpg', 1, 'image'),
(28, '859855-1536x864.jpg', '1677146721.jpg', 1, 'image'),
(29, 'วันมาฆบูชา.jpg', '1677146722.jpg', 1, 'image'),
(30, '311127072_474887388010549_5930669985484095435_n.jpg', '1677402924.jpg', 1, 'image'),
(31, 'R (1).jpg', '1677404354.jpg', 1, 'image'),
(32, 'wat-sakhla.jpg', '1677406166.jpg', 1, 'image'),
(34, 'Asokkaram-750x468.jpg', '1677418306.jpg', 1, 'image'),
(35, 'image4752_4.jpg', '1677419404.jpg', 1, 'image'),
(50, '20221108_182613.jpg', '1677421430.jpg', 1, 'image'),
(51, '20221108_182839.jpg', '1677421431.jpg', 1, 'image'),
(52, '20221108_183141.jpg', '1677421432.jpg', 1, 'image'),
(53, '20221108_183144.jpg', '1677421433.jpg', 1, 'image'),
(54, '20221108_183326.jpg', '1677421434.jpg', 1, 'image'),
(55, '20221108_183338.jpg', '1677421435.jpg', 1, 'image'),
(56, '308791238_159336686719212_8770763840726509628_n.jpg', '1677422929.jpg', 1, 'image'),
(57, 'Picture1.jpg', '1677673592.jpg', 1, 'image'),
(59, '311127072.jpg', '1677674507.jpg', 1, 'image'),
(60, 'Picture3.jpg', '1677674918.jpg', 1, 'image'),
(61, 'Picture4.jpg', '1677675364.jpg', 1, 'image'),
(62, 'R56-3.jpg', '1677675913.jpg', 1, 'image'),
(63, 'Screenshot 2023-03-01 201639.png', '1677676644.png', 1, 'image'),
(64, 'thai-temple-ancient-thailand-53762126.jpg', '1677677024.jpg', 1, 'image'),
(65, 'วัดชัยมงคล_(จังหวัดสมุทรปราการ)_02 (1).jpg', '1677677876.jpg', 1, 'image'),
(66, '1.jpg', '1677678585.jpg', 1, 'image'),
(67, 'IMG20200513182426.webp', '1677679084.webp', 1, 'image'),
(68, 'R (2).jpg', '1677681776.jpg', 1, 'image');

-- --------------------------------------------------------

--
-- Table structure for table `table_hotel`
--

CREATE TABLE `table_hotel` (
  `ht_id` int(10) UNSIGNED NOT NULL,
  `ht_name` text NOT NULL,
  `ht_img` text NOT NULL,
  `ht_url` text NOT NULL,
  `ht_lat` double NOT NULL,
  `ht_lon` double NOT NULL,
  `ht_place_ref` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_hotel`
--

INSERT INTO `table_hotel` (`ht_id`, `ht_name`, `ht_img`, `ht_url`, `ht_lat`, `ht_lon`, `ht_place_ref`) VALUES
(1, 'โรงแรมบ้านปากน้ำ', './images/1676711216.jpg', 'https://www.baanpaknamhotel.com/', 13.58049232234145, 100.60220840569184, 1),
(2, 'ไมด้า แอร์พอร์ต โฮเต็ล กรุงเทพ', './images/1677146591.jpg', 'https://th.tripadvisor.com/Hotel_Review-g293916-d305557-Reviews-Mida_Hotel_Don_Mueang_Airport_Bangkok-Bangkok.html#/media/305557/230813521:p/?albumid=101&type=0&category=101', 13.889766853232, 100.57852156974, 6);

-- --------------------------------------------------------

--
-- Table structure for table `table_local`
--

CREATE TABLE `table_local` (
  `lc_id` int(11) NOT NULL,
  `lc_tumbol` tinytext NOT NULL,
  `lc_province` tinytext NOT NULL,
  `lc_amphoe` tinytext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_local`
--

INSERT INTO `table_local` (`lc_id`, `lc_tumbol`, `lc_province`, `lc_amphoe`) VALUES
(1, 'ปากน้ำ', 'สมุทรปราการ', 'เมือง'),
(2, 'บางพลีใหญ่', 'สมุทรปราการ', 'บางพลี'),
(3, 'พระประแดง', 'สมุทรปราการ', 'ตลาด'),
(4, 'คลองด่าน', 'สมุทรปราการ', 'บางบ่อ'),
(5, 'ท้ายบ้าน', 'สมุทรปราการ', 'เมือง'),
(6, 'อนุสาวรีย์', 'กรุงเทพมหานคร', 'บางเขน'),
(7, 'บางปู', 'สมุทรปราการ', 'เมือง'),
(8, 'นาเกลือ', 'สมุทรปราการ', 'พระสมุทรเจดีย์'),
(9, 'บางเสาธง', 'สมุทรปราการ', 'บางเสาธง'),
(10, 'คันนายาว', 'กรุงเทพมหานคร', 'คันนายาว'),
(11, 'จตุจักร', 'กรุงเทพมหานคร', 'จตุจักร'),
(12, 'สนามบิน', 'กรุงเทพมหานคร', 'ดอนเมือง'),
(13, 'ประชาธิปัตย์', 'นนทบุรี', 'ธัญบุรี'),
(14, 'บางปูใหม่', 'สมุทรปราการ', 'เมือง');

-- --------------------------------------------------------

--
-- Table structure for table `table_moon_calendar`
--

CREATE TABLE `table_moon_calendar` (
  `moon_year` int(10) UNSIGNED NOT NULL,
  `moon_start_date` tinyint(3) UNSIGNED NOT NULL,
  `moon_start_month` tinyint(3) UNSIGNED NOT NULL,
  `moon_double_eighth` tinyint(1) NOT NULL,
  `moon_start_long` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_moon_calendar`
--

INSERT INTO `table_moon_calendar` (`moon_year`, `moon_start_date`, `moon_start_month`, `moon_double_eighth`, `moon_start_long`) VALUES
(2023, 10, 2, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `table_otop`
--

CREATE TABLE `table_otop` (
  `otop_id` int(10) UNSIGNED NOT NULL,
  `otop_name` text NOT NULL,
  `otop_event_ref` int(10) UNSIGNED NOT NULL,
  `otop_img` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `table_place`
--

CREATE TABLE `table_place` (
  `pl_id` int(11) NOT NULL,
  `pl_name` varchar(50) NOT NULL,
  `pl_geo_lat` decimal(32,29) NOT NULL,
  `pl_geo_lon` decimal(32,29) NOT NULL,
  `pl_amphoe` int(11) NOT NULL,
  `pl_desc` text NOT NULL,
  `pl_origin` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_place`
--

INSERT INTO `table_place` (`pl_id`, `pl_name`, `pl_geo_lat`, `pl_geo_lon`, `pl_amphoe`, `pl_desc`, `pl_origin`) VALUES
(1, 'ศาลากลางจังหวัดสมุทรปราการ', '13.59954753288291200000000000000', '100.59634001073748000000000000000', 1, '', 0),
(2, 'วัดบางพลีใหญ่ใน', '13.60493750000000000000000000000', '100.71118750000000000000000000000', 2, '', 1),
(3, 'ที่ว่าการอำเภอพระประแดง', '13.65869608655996500000000000000', '100.53378414681625000000000000000', 3, '', 1),
(4, 'วัดมงคลโคธาวาส', '13.51357695537153300000000000000', '100.82084674827094000000000000000', 4, '', 1),
(6, 'วัดพระศรีมหาธาตุ', '13.87534949547723400000000000000', '100.59680479463012000000000000000', 6, '', 1),
(7, 'วัดอโศการามวรมหาวรวิหาร', '13.54746000000000000000000000000', '100.60804000000000000000000000000', 7, '', 1),
(8, 'วัดสาขลา', '13.54537886218486700000000000000', '100.50042016057150000000000000000', 8, '', 1),
(9, 'วัดบัวโรย', '13.65090000000000000000000000000', '100.85810000000000000000000000000', 9, '', 1),
(10, 'แฟชันไอแลนต์', '13.82636665830665200000000000000', '100.67943349296020000000000000000', 10, '', 1),
(11, 'เซ็นทรัลลาดพร้าว', '13.81622745937050000000000000000', '100.56105163340277000000000000000', 11, '', 1),
(12, 'สนามบินดอนเมือง', '13.91408767295619000000000000000', '100.60616942591201000000000000000', 12, '', 1),
(13, 'ฟิวเจอร์ปาร์ครังสิต', '13.98959954966763200000000000000', '100.61787024497661000000000000000', 13, '', 1),
(14, 'วัดกลางวรวิหาร', '13.59301462686887000000000000000', '100.59916605255425000000000000000', 1, '', 1),
(15, 'วัดโพธิยาราม (จังหวัดสมุทรปราการ)', '13.57411118101889400000000000000', '100.59528311335873000000000000000', 5, '', 1),
(16, 'วัดชัยมงคล', '13.58620000000000000000000000000', '100.60440000000000000000000000000', 1, '', 1),
(17, 'วัดศรีจันทประดิษฐ์', '13.51540000000000000000000000000', '100.64390000000000000000000000000', 14, '', 1);

-- --------------------------------------------------------

--
-- Table structure for table `table_user`
--

CREATE TABLE `table_user` (
  `us_id` int(11) NOT NULL,
  `us_name` text NOT NULL,
  `us_pass` text NOT NULL,
  `us_fname` text NOT NULL,
  `us_superuser` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_user`
--

INSERT INTO `table_user` (`us_id`, `us_name`, `us_pass`, `us_fname`, `us_superuser`) VALUES
(1, 'admin', '12345', 'Administrator', 1);

-- --------------------------------------------------------

--
-- Table structure for table `table_viewpoint`
--

CREATE TABLE `table_viewpoint` (
  `vp_id` bigint(20) NOT NULL,
  `vp_name` text NOT NULL,
  `vp_img` text NOT NULL,
  `vp_event_ref` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `table_viewpoint`
--

INSERT INTO `table_viewpoint` (`vp_id`, `vp_name`, `vp_img`, `vp_event_ref`) VALUES
(13, 'รูปบรรยากาศงาน 1', './images/1677146720.jpg', 24),
(14, 'รูปบรรยากาศงาน 2', './images/1677146721.jpg', 24),
(17, 'รูปบรรยากาศของวัดสาขลา', './images/1677406166.jpg', 26);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `table_event`
--
ALTER TABLE `table_event`
  ADD PRIMARY KEY (`ev_id`);

--
-- Indexes for table `table_file`
--
ALTER TABLE `table_file`
  ADD PRIMARY KEY (`file_id`);

--
-- Indexes for table `table_hotel`
--
ALTER TABLE `table_hotel`
  ADD PRIMARY KEY (`ht_id`);

--
-- Indexes for table `table_local`
--
ALTER TABLE `table_local`
  ADD PRIMARY KEY (`lc_id`);

--
-- Indexes for table `table_moon_calendar`
--
ALTER TABLE `table_moon_calendar`
  ADD PRIMARY KEY (`moon_year`);

--
-- Indexes for table `table_otop`
--
ALTER TABLE `table_otop`
  ADD PRIMARY KEY (`otop_id`);

--
-- Indexes for table `table_place`
--
ALTER TABLE `table_place`
  ADD PRIMARY KEY (`pl_id`);

--
-- Indexes for table `table_user`
--
ALTER TABLE `table_user`
  ADD PRIMARY KEY (`us_id`);

--
-- Indexes for table `table_viewpoint`
--
ALTER TABLE `table_viewpoint`
  ADD PRIMARY KEY (`vp_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `table_event`
--
ALTER TABLE `table_event`
  MODIFY `ev_id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT for table `table_file`
--
ALTER TABLE `table_file`
  MODIFY `file_id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `table_hotel`
--
ALTER TABLE `table_hotel`
  MODIFY `ht_id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `table_local`
--
ALTER TABLE `table_local`
  MODIFY `lc_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `table_otop`
--
ALTER TABLE `table_otop`
  MODIFY `otop_id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `table_place`
--
ALTER TABLE `table_place`
  MODIFY `pl_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `table_user`
--
ALTER TABLE `table_user`
  MODIFY `us_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `table_viewpoint`
--
ALTER TABLE `table_viewpoint`
  MODIFY `vp_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
